app/Controllers/UnitKerja.php

SELECT *
FROM `unit_kerja`
---
    public function index()
    {
        $data['unit_kerja'] = $this->uk->findAll();